In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("C:\\Users\\Lunarblade\\Desktop\\Sachin_ODI.csv")
df

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Won,century
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,False,False
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,False,False
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,True,False
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,True,False
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
355,14,0,34,15,2,0,93.33,2,Australia,Sydney,2012-02-26,Australia,False,False
356,39,0,45,30,5,0,130.00,2,Sri Lanka,Hobart,2012-02-28,India,True,False
357,6,0,25,19,1,0,31.57,1,Sri Lanka,Dhaka,2012-03-13,India,True,False
358,114,0,205,147,12,1,77.55,1,Bangladesh,Dhaka,2012-03-16,Bangladesh,False,True
359,52,0,93,48,5,1,108.33,2,Pakistan,Dhaka,2012-03-18,India,True,False

In [11]:
pd.crosstab(index=df["century"],columns=df["Won"],margins=True)

Won      False  True  All
century
False      160   154  314
True        16    30   46
All        176   184  360

In [15]:
# 119  24
#  3   154

(119+24)/300

0.4766666666666667

In [16]:
(119+3)/300

0.4066666666666667

In [17]:
119/300

0.39666666666666667

In [18]:
0.4766666666666667+0.4066666666666667-0.39666666666666667

0.48666666666666664

In [19]:
119/122

0.9754098360655737

In [20]:
119/143

0.8321678321678322

In [25]:
len(df[df['Opp']=='South Africa'])

44

In [29]:
len(df[(df['century']==True)&(df['Opp']=='South Africa')])

5

In [30]:
5/44

0.11363636363636363

In [31]:
5/46

0.10869565217391304

In [32]:
df = pd.read_csv("C:\\Users\\Lunarblade\\Desktop\\covid_m1.csv")
df

     m1  s
0     0  0
1     0  1
2     0  1
3     0  0
4     1  1
..   .. ..
995   0  1
996   0  1
997   0  0
998   0  1
999   0  0

[1000 rows x 2 columns]

In [34]:
len(df[df['m1']==1])

100

In [35]:
len(df[df['s']==1])

700

In [36]:
len(df[(df['m1']==1)&(df['s']==1)])

95

In [37]:
len(df)

1000

In [38]:
95/700

0.1357142857142857